In [1]:
import pandas as pd
import numpy as np
import seaborn as sb
import matplotlib.pyplot as plt

In [2]:
train=pd.read_csv("train.csv")
test=pd.read_csv("test.csv")

In [3]:
train=train.drop(["Name","SibSp","Parch","Fare","Cabin"], axis=1)

In [4]:
train.Age.fillna(train.Age.median(),inplace=True)

In [5]:
train.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Sex            0
Age            0
Ticket         0
Embarked       2
dtype: int64

In [6]:
train['Embarked'].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [8]:
train.Embarked.fillna('S',inplace=True)

In [9]:
train.head()

   PassengerId  Survived  Pclass     Sex   Age            Ticket Embarked
0            1         0       3    male  22.0         A/5 21171        S
1            2         1       1  female  38.0          PC 17599        C
2            3         1       3  female  26.0  STON/O2. 3101282        S
3            4         1       1  female  35.0            113803        S
4            5         0       3    male  35.0            373450        S

In [11]:
train=train.drop(["PassengerId","Ticket"],axis=1)

In [12]:
train.head()

   Survived  Pclass     Sex   Age Embarked
0         0       3    male  22.0        S
1         1       1  female  38.0        C
2         1       3  female  26.0        S
3         1       1  female  35.0        S
4         0       3    male  35.0        S

In [13]:
train.isnull().sum()

Survived    0
Pclass      0
Sex         0
Age         0
Embarked    0
dtype: int64

In [15]:
train['Sex']=train['Sex'].map({'male':0,'female':1})

In [16]:
train['Embarked']=train['Embarked'].map({'S':0,'C':1,'Q':2})

In [17]:
train.head()

   Survived  Pclass  Sex   Age  Embarked
0         0       3    0  22.0         0
1         1       1    1  38.0         1
2         1       3    1  26.0         0
3         1       1    1  35.0         0
4         0       3    0  35.0         0

In [18]:
X=train.drop('Survived',axis=1)
y=train['Survived']

In [19]:
X.head()

   Pclass  Sex   Age  Embarked
0       3    0  22.0         0
1       1    1  38.0         1
2       3    1  26.0         0
3       1    1  35.0         0
4       3    0  35.0         0

In [20]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.3,random_state=42)

In [21]:
X_train.shape

(623, 4)

In [22]:
X_train.head()

     Pclass  Sex   Age  Embarked
445       1    0   4.0         0
650       3    0  28.0         0
172       3    1   1.0         0
450       2    0  36.0         0
314       2    0  43.0         0

In [23]:
from sklearn.neighbors import KNeighborsClassifier
nb=KNeighborsClassifier(n_neighbors=13)

In [25]:
nb.fit(X_train,y_train)

KNeighborsClassifier(algorithm='auto', leaf_size=30, metric='minkowski',
           metric_params=None, n_jobs=1, n_neighbors=13, p=2,
           weights='uniform')

In [26]:
y_pred=nb.predict(X_test)

In [27]:
from sklearn import metrics

In [29]:
metrics.accuracy_score(y_pred,y_test)

0.70522388059701491

In [30]:
metrics.confusion_matrix(y_pred,y_test)

array([[141,  63],
       [ 16,  48]], dtype=int64)